In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [4]:
df = pd.read_csv("dummy_.csv")
df.head()

  Car Model  Mileage  Sell Price($)  Age(yrs)
0    BMW X5    69000          18000         6
1    BMW X5    35000          34000         3
2    BMW X5    57000          26100         5
3    BMW X5    22500          40000         2
4    BMW X5    46000          31500         4

In [6]:
df.isnull().sum()

Car Model        0
Mileage          0
Sell Price($)    0
Age(yrs)         0
dtype: int64

In [7]:
df["Car Model"].unique()

array(['BMW X5', 'Audi A5', 'Mercedez Benz C class'], dtype=object)

In [12]:
a  = pd.get_dummies(df["Car Model"],drop_first =  True)
a.head()

   BMW X5  Mercedez Benz C class
0       1                      0
1       1                      0
2       1                      0
3       1                      0
4       1                      0

In [16]:
b = df[["Mileage","Age(yrs)"]]
b.head()

   Mileage  Age(yrs)
0    69000         6
1    35000         3
2    57000         5
3    22500         2
4    46000         4

In [35]:
x = pd.concat([a,b],axis = 1)
x

    BMW X5  Mercedez Benz C class  Mileage  Age(yrs)
0        1                      0    69000         6
1        1                      0    35000         3
2        1                      0    57000         5
3        1                      0    22500         2
4        1                      0    46000         4
5        0                      0    59000         5
6        0                      0    52000         5
7        0                      0    72000         6
8        0                      0    91000         8
9        0                      1    67000         6
10       0                      1    83000         7
11       0                      1    79000         7
12       0                      1    59000         5

In [25]:
y = df["Sell Price($)"]

In [26]:
from sklearn.model_selection import train_test_split

In [38]:
x_train,x_test,y_train,y_test = train_test_split(x,y,train_size = .9,random_state = 42)

In [39]:
from sklearn.linear_model import  LinearRegression

In [40]:
model = LinearRegression()

In [41]:
model.fit(x_train,y_train)

LinearRegression()

In [42]:
model.predict(x_test)

array([23439.81042655, 29361.61137442])

In [43]:
model.predict([[0,1,45000,4]])

array([39774.40758295])

In [47]:
model.score(x_test,y_test)

-119.29199389096179

In [45]:
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5